espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_reg.h
/** PPA_INT_ST_REG register
 *  Masked interrupt
 */
#define PPA_INT_ST_REG (DR_REG_PPA_BASE + 0x14)
/** PPA_SR_EOF_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the PPA_SR_EOF_INT interrupt.
 */
#define PPA_SR_EOF_INT_ST    (BIT(0))
#define PPA_SR_EOF_INT_ST_M  (PPA_SR_EOF_INT_ST_V << PPA_SR_EOF_INT_ST_S)
#define PPA_SR_EOF_INT_ST_V  0x00000001U
#define PPA_SR_EOF_INT_ST_S  0
/** PPA_BLEND_EOF_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the PPA_BLEND_EOF_INT interrupt.
 */
#define PPA_BLEND_EOF_INT_ST    (BIT(1))
#define PPA_BLEND_EOF_INT_ST_M  (PPA_BLEND_EOF_INT_ST_V << PPA_BLEND_EOF_INT_ST_S)
#define PPA_BLEND_EOF_INT_ST_V  0x00000001U
#define PPA_BLEND_EOF_INT_ST_S  1
/** PPA_SR_PARAM_CFG_ERR_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the PPA_SR_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_SR_PARAM_CFG_ERR_INT_ST    (BIT(2))
#define PPA_SR_PARAM_CFG_ERR_INT_ST_M  (PPA_SR_PARAM_CFG_ERR_INT_ST_V << PPA_SR_PARAM_CFG_ERR_INT_ST_S)
#define PPA_SR_PARAM_CFG_ERR_INT_ST_V  0x00000001U
#define PPA_SR_PARAM_CFG_ERR_INT_ST_S  2
/** PPA_BLEND_PARAM_CFG_ERR_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_BLEND_PARAM_CFG_ERR_INT_ST    (BIT(3))
#define PPA_BLEND_PARAM_CFG_ERR_INT_ST_M  (PPA_BLEND_PARAM_CFG_ERR_INT_ST_V << PPA_BLEND_PARAM_CFG_ERR_INT_ST_S)
#define PPA_BLEND_PARAM_CFG_ERR_INT_ST_V  0x00000001U
#define PPA_BLEND_PARAM_CFG_ERR_INT_ST_S  3

/** PPA_INT_ENA_REG register
 *  Interrupt enable bits
 */
#define PPA_INT_ENA_REG (DR_REG_PPA_BASE + 0x18)
/** PPA_SR_EOF_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the PPA_SR_EOF_INT interrupt.
 */
#define PPA_SR_EOF_INT_ENA    (BIT(0))
#define PPA_SR_EOF_INT_ENA_M  (PPA_SR_EOF_INT_ENA_V << PPA_SR_EOF_INT_ENA_S)
#define PPA_SR_EOF_INT_ENA_V  0x00000001U
#define PPA_SR_EOF_INT_ENA_S  0
/** PPA_BLEND_EOF_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the PPA_BLEND_EOF_INT interrupt.
 */
#define PPA_BLEND_EOF_INT_ENA    (BIT(1))
#define PPA_BLEND_EOF_INT_ENA_M  (PPA_BLEND_EOF_INT_ENA_V << PPA_BLEND_EOF_INT_ENA_S)
#define PPA_BLEND_EOF_INT_ENA_V  0x00000001U
#define PPA_BLEND_EOF_INT_ENA_S  1
/** PPA_SR_PARAM_CFG_ERR_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the PPA_SR_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_SR_PARAM_CFG_ERR_INT_ENA    (BIT(2))
#define PPA_SR_PARAM_CFG_ERR_INT_ENA_M  (PPA_SR_PARAM_CFG_ERR_INT_ENA_V << PPA_SR_PARAM_CFG_ERR_INT_ENA_S)
#define PPA_SR_PARAM_CFG_ERR_INT_ENA_V  0x00000001U
#define PPA_SR_PARAM_CFG_ERR_INT_ENA_S  2
/** PPA_BLEND_PARAM_CFG_ERR_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_BLEND_PARAM_CFG_ERR_INT_ENA    (BIT(3))
#define PPA_BLEND_PARAM_CFG_ERR_INT_ENA_M  (PPA_BLEND_PARAM_CFG_ERR_INT_ENA_V << PPA_BLEND_PARAM_CFG_ERR_INT_ENA_S)
#define PPA_BLEND_PARAM_CFG_ERR_INT_ENA_V  0x00000001U
#define PPA_BLEND_PARAM_CFG_ERR_INT_ENA_S  3

/** PPA_INT_CLR_REG register
 *  Interrupt clear bits
 */
#define PPA_INT_CLR_REG (DR_REG_PPA_BASE + 0x1c)
/** PPA_SR_EOF_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the PPA_SR_EOF_INT interrupt.
 */
#define PPA_SR_EOF_INT_CLR    (BIT(0))
#define PPA_SR_EOF_INT_CLR_M  (PPA_SR_EOF_INT_CLR_V << PPA_SR_EOF_INT_CLR_S)
#define PPA_SR_EOF_INT_CLR_V  0x00000001U
#define PPA_SR_EOF_INT_CLR_S  0
/** PPA_BLEND_EOF_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the PPA_BLEND_EOF_INT interrupt.
 */
#define PPA_BLEND_EOF_INT_CLR    (BIT(1))
#define PPA_BLEND_EOF_INT_CLR_M  (PPA_BLEND_EOF_INT_CLR_V << PPA_BLEND_EOF_INT_CLR_S)
#define PPA_BLEND_EOF_INT_CLR_V  0x00000001U
#define PPA_BLEND_EOF_INT_CLR_S  1
/** PPA_SR_PARAM_CFG_ERR_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the PPA_SR_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_SR_PARAM_CFG_ERR_INT_CLR    (BIT(2))
#define PPA_SR_PARAM_CFG_ERR_INT_CLR_M  (PPA_SR_PARAM_CFG_ERR_INT_CLR_V << PPA_SR_PARAM_CFG_ERR_INT_CLR_S)
#define PPA_SR_PARAM_CFG_ERR_INT_CLR_V  0x00000001U
#define PPA_SR_PARAM_CFG_ERR_INT_CLR_S  2
/** PPA_BLEND_PARAM_CFG_ERR_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
 */
#define PPA_BLEND_PARAM_CFG_ERR_INT_CLR    (BIT(3))
#define PPA_BLEND_PARAM_CFG_ERR_INT_CLR_M  (PPA_BLEND_PARAM_CFG_ERR_INT_CLR_V << PPA_BLEND_PARAM_CFG_ERR_INT_CLR_S)
#define PPA_BLEND_PARAM_CFG_ERR_INT_CLR_V  0x00000001U
#define PPA_BLEND_PARAM_CFG_ERR_INT_CLR_S  3

/** PPA_SR_COLOR_MODE_REG register
 *  Scaling and rotating engine color mode register
 */
#define PPA_SR_COLOR_MODE_REG (DR_REG_PPA_BASE + 0x20)
/** PPA_SR_RX_CM : R/W; bitpos: [3:0]; default: 0;
 *  The source image color mode for Scaling and Rotating engine Rx. 0: ARGB8888. 1:
 *  RGB888. 2: RGB565. 8: YUV420. 9: YUV422. 12: GRAY. others: Reserved.
 */
#define PPA_SR_RX_CM    0x0000000FU
#define PPA_SR_RX_CM_M  (PPA_SR_RX_CM_V << PPA_SR_RX_CM_S)
#define PPA_SR_RX_CM_V  0x0000000FU
#define PPA_SR_RX_CM_S  0
/** PPA_SR_TX_CM : R/W; bitpos: [7:4]; default: 0;
 *  The destination image color mode for Scaling and Rotating engine Tx. 0: ARGB8888.
 *  1: RGB888. 2: RGB565. 8: YUV420. 9: YUV422. 12: GRAY. others: Reserved.
 */
#define PPA_SR_TX_CM    0x0000000FU
#define PPA_SR_TX_CM_M  (PPA_SR_TX_CM_V << PPA_SR_TX_CM_S)
#define PPA_SR_TX_CM_V  0x0000000FU
#define PPA_SR_TX_CM_S  4
/** PPA_YUV_RX_RANGE : R/W; bitpos: [8]; default: 0;
 *  YUV input range when reg_sr_rx_cm is 4'd8. 0: limit range. 1: full range
 */
#define PPA_YUV_RX_RANGE    (BIT(8))
#define PPA_YUV_RX_RANGE_M  (PPA_YUV_RX_RANGE_V << PPA_YUV_RX_RANGE_S)
#define PPA_YUV_RX_RANGE_V  0x00000001U
#define PPA_YUV_RX_RANGE_S  8
/** PPA_YUV_TX_RANGE : R/W; bitpos: [9]; default: 0;
 *  YUV output range when reg_sr_tx_cm is 4'd8. 0: limit range. 1: full range
 */
#define PPA_YUV_TX_RANGE    (BIT(9))
#define PPA_YUV_TX_RANGE_M  (PPA_YUV_TX_RANGE_V << PPA_YUV_TX_RANGE_S)
#define PPA_YUV_TX_RANGE_V  0x00000001U
#define PPA_YUV_TX_RANGE_S  9
/** PPA_YUV2RGB_PROTOCOL : R/W; bitpos: [10]; default: 0;
 *  YUV to RGB protocol when reg_sr_rx_cm is 4'd8. 0: BT601. 1: BT709
 */
#define PPA_YUV2RGB_PROTOCOL    (BIT(10))
#define PPA_YUV2RGB_PROTOCOL_M  (PPA_YUV2RGB_PROTOCOL_V << PPA_YUV2RGB_PROTOCOL_S)
#define PPA_YUV2RGB_PROTOCOL_V  0x00000001U
#define PPA_YUV2RGB_PROTOCOL_S  10
/** PPA_RGB2YUV_PROTOCOL : R/W; bitpos: [11]; default: 0;
 *  RGB to YUV protocol when reg_sr_tx_cm is 4'd8. 0: BT601. 1: BT709
 */
#define PPA_RGB2YUV_PROTOCOL    (BIT(11))
#define PPA_RGB2YUV_PROTOCOL_M  (PPA_RGB2YUV_PROTOCOL_V << PPA_RGB2YUV_PROTOCOL_S)
#define PPA_RGB2YUV_PROTOCOL_V  0x00000001U
#define PPA_RGB2YUV_PROTOCOL_S  11
/** PPA_YUV422_RX_BYTE_ORDER : R/W; bitpos: [13:12]; default: 0;
 *  YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY (high addr -> low addr)
 */
#define PPA_YUV422_RX_BYTE_ORDER    0x00000003U
#define PPA_YUV422_RX_BYTE_ORDER_M  (PPA_YUV422_RX_BYTE_ORDER_V << PPA_YUV422_RX_BYTE_ORDER_S)
#define PPA_YUV422_RX_BYTE_ORDER_V  0x00000003U
#define PPA_YUV422_RX_BYTE_ORDER_S  12

/** PPA_BLEND_COLOR_MODE_REG register
 *  blending engine color mode register
 */
#define PPA_BLEND_COLOR_MODE_REG (DR_REG_PPA_BASE + 0x24)
/** PPA_BLEND0_RX_CM : R/W; bitpos: [3:0]; default: 0;
 *  The source image color mode for background plane. 0: ARGB8888. 1: RGB888. 2:
 *  RGB565. 3: Reserved. 4: L8. 5: L4. 8: YUV420. 9: YUV422. 12:GRAY
 */
#define PPA_BLEND0_RX_CM    0x0000000FU
#define PPA_BLEND0_RX_CM_M  (PPA_BLEND0_RX_CM_V << PPA_BLEND0_RX_CM_S)
#define PPA_BLEND0_RX_CM_V  0x0000000FU
#define PPA_BLEND0_RX_CM_S  0
/** PPA_BLEND1_RX_CM : R/W; bitpos: [7:4]; default: 0;
 *  The source image color mode for foreground plane. 0: ARGB8888. 1: RGB888. 2:
 *  RGB565. 3: Reserved. 4: L8. 5: L4. 6: A8. 7: A4.
 */
#define PPA_BLEND1_RX_CM    0x0000000FU
#define PPA_BLEND1_RX_CM_M  (PPA_BLEND1_RX_CM_V << PPA_BLEND1_RX_CM_S)
#define PPA_BLEND1_RX_CM_V  0x0000000FU
#define PPA_BLEND1_RX_CM_S  4
/** PPA_BLEND_TX_CM : R/W; bitpos: [11:8]; default: 0;
 *  The destination image color mode for output of blender. 0: ARGB8888. 1: RGB888. 2:
 *  RGB565. 3: Reserved. 8: YUV420. 9: YUV422. 12:GRAY
 */
#define PPA_BLEND_TX_CM    0x0000000FU
#define PPA_BLEND_TX_CM_M  (PPA_BLEND_TX_CM_V << PPA_BLEND_TX_CM_S)
#define PPA_BLEND_TX_CM_V  0x0000000FU
#define PPA_BLEND_TX_CM_S  8
/** PPA_BLEND0_RX_YUV_RANGE : R/W; bitpos: [12]; default: 0;
 *  YUV input range when blend0 rx cm is yuv. 0: limit range. 1: full range
 */
#define PPA_BLEND0_RX_YUV_RANGE    (BIT(12))
#define PPA_BLEND0_RX_YUV_RANGE_M  (PPA_BLEND0_RX_YUV_RANGE_V << PPA_BLEND0_RX_YUV_RANGE_S)
#define PPA_BLEND0_RX_YUV_RANGE_V  0x00000001U
#define PPA_BLEND0_RX_YUV_RANGE_S  12
/** PPA_BLEND_TX_YUV_RANGE : R/W; bitpos: [13]; default: 0;
 *  YUV output range when blend tx cm is yuv. 0: limit range. 1: full range
 */
#define PPA_BLEND_TX_YUV_RANGE    (BIT(13))
#define PPA_BLEND_TX_YUV_RANGE_M  (PPA_BLEND_TX_YUV_RANGE_V << PPA_BLEND_TX_YUV_RANGE_S)
#define PPA_BLEND_TX_YUV_RANGE_V  0x00000001U
#define PPA_BLEND_TX_YUV_RANGE_S  13
/** PPA_BLEND0_RX_YUV2RGB_PROTOCOL : R/W; bitpos: [14]; default: 0;
 *  YUV to RGB protocol when blend0 rx cm is yuv. 0: BT601. 1: BT709
 */
#define PPA_BLEND0_RX_YUV2RGB_PROTOCOL    (BIT(14))
#define PPA_BLEND0_RX_YUV2RGB_PROTOCOL_M  (PPA_BLEND0_RX_YUV2RGB_PROTOCOL_V << PPA_BLEND0_RX_YUV2RGB_PROTOCOL_S)
#define PPA_BLEND0_RX_YUV2RGB_PROTOCOL_V  0x00000001U
#define PPA_BLEND0_RX_YUV2RGB_PROTOCOL_S  14
/** PPA_BLEND_TX_RGB2YUV_PROTOCOL : R/W; bitpos: [15]; default: 0;
 *  RGB to YUV protocol when blend tx cm is yuv. 0: BT601. 1: BT709
 */
#define PPA_BLEND_TX_RGB2YUV_PROTOCOL    (BIT(15))
#define PPA_BLEND_TX_RGB2YUV_PROTOCOL_M  (PPA_BLEND_TX_RGB2YUV_PROTOCOL_V << PPA_BLEND_TX_RGB2YUV_PROTOCOL_S)
#define PPA_BLEND_TX_RGB2YUV_PROTOCOL_V  0x00000001U
#define PPA_BLEND_TX_RGB2YUV_PROTOCOL_S  15
/** PPA_BLEND0_RX_YUV422_BYTE_ORDER : R/W; bitpos: [17:16]; default: 0;
 *  YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY (high addr -> low addr)
 */
#define PPA_BLEND0_RX_YUV422_BYTE_ORDER    0x00000003U
#define PPA_BLEND0_RX_YUV422_BYTE_ORDER_M  (PPA_BLEND0_RX_YUV422_BYTE_ORDER_V << PPA_BLEND0_RX_YUV422_BYTE_ORDER_S)
#define PPA_BLEND0_RX_YUV422_BYTE_ORDER_V  0x00000003U
#define PPA_BLEND0_RX_YUV422_BYTE_ORDER_S  16

/** PPA_SR_BYTE_ORDER_REG register
 *  Scaling and rotating engine byte order register
 */
#define PPA_SR_BYTE_ORDER_REG (DR_REG_PPA_BASE + 0x28)
/** PPA_SR_RX_BYTE_SWAP_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
 *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
 */
#define PPA_SR_RX_BYTE_SWAP_EN    (BIT(0))
#define PPA_SR_RX_BYTE_SWAP_EN_M  (PPA_SR_RX_BYTE_SWAP_EN_V << PPA_SR_RX_BYTE_SWAP_EN_S)
#define PPA_SR_RX_BYTE_SWAP_EN_V  0x00000001U
#define PPA_SR_RX_BYTE_SWAP_EN_S  0
/** PPA_SR_RX_RGB_SWAP_EN : R/W; bitpos: [1]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
 *  would be swap to bgr.
 */
#define PPA_SR_RX_RGB_SWAP_EN    (BIT(1))
#define PPA_SR_RX_RGB_SWAP_EN_M  (PPA_SR_RX_RGB_SWAP_EN_V << PPA_SR_RX_RGB_SWAP_EN_S)
#define PPA_SR_RX_RGB_SWAP_EN_V  0x00000001U
#define PPA_SR_RX_RGB_SWAP_EN_S  1
/** PPA_SR_MACRO_BK_RO_BYPASS : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to bypass the macro block order function. This function is used
 *  to improve efficient accessing external memory.
 */
#define PPA_SR_MACRO_BK_RO_BYPASS    (BIT(2))
#define PPA_SR_MACRO_BK_RO_BYPASS_M  (PPA_SR_MACRO_BK_RO_BYPASS_V << PPA_SR_MACRO_BK_RO_BYPASS_S)
#define PPA_SR_MACRO_BK_RO_BYPASS_V  0x00000001U
#define PPA_SR_MACRO_BK_RO_BYPASS_S  2
/** PPA_SR_BK_SIZE_SEL : R/W; bitpos: [3]; default: 0;
 *  sel srm pix_blk size, 0:32x32, 1:16x16
 */
#define PPA_SR_BK_SIZE_SEL    (BIT(3))
#define PPA_SR_BK_SIZE_SEL_M  (PPA_SR_BK_SIZE_SEL_V << PPA_SR_BK_SIZE_SEL_S)
#define PPA_SR_BK_SIZE_SEL_V  0x00000001U
#define PPA_SR_BK_SIZE_SEL_S  3

