espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_reg.h
/** PPA_BLEND_BYTE_ORDER_REG register
 *  Blending engine byte order register
 */
#define PPA_BLEND_BYTE_ORDER_REG (DR_REG_PPA_BASE + 0x2c)
/** PPA_BLEND0_RX_BYTE_SWAP_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
 *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
 */
#define PPA_BLEND0_RX_BYTE_SWAP_EN    (BIT(0))
#define PPA_BLEND0_RX_BYTE_SWAP_EN_M  (PPA_BLEND0_RX_BYTE_SWAP_EN_V << PPA_BLEND0_RX_BYTE_SWAP_EN_S)
#define PPA_BLEND0_RX_BYTE_SWAP_EN_V  0x00000001U
#define PPA_BLEND0_RX_BYTE_SWAP_EN_S  0
/** PPA_BLEND1_RX_BYTE_SWAP_EN : R/W; bitpos: [1]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
 *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
 */
#define PPA_BLEND1_RX_BYTE_SWAP_EN    (BIT(1))
#define PPA_BLEND1_RX_BYTE_SWAP_EN_M  (PPA_BLEND1_RX_BYTE_SWAP_EN_V << PPA_BLEND1_RX_BYTE_SWAP_EN_S)
#define PPA_BLEND1_RX_BYTE_SWAP_EN_V  0x00000001U
#define PPA_BLEND1_RX_BYTE_SWAP_EN_S  1
/** PPA_BLEND0_RX_RGB_SWAP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
 *  would be swap to bgr.
 */
#define PPA_BLEND0_RX_RGB_SWAP_EN    (BIT(2))
#define PPA_BLEND0_RX_RGB_SWAP_EN_M  (PPA_BLEND0_RX_RGB_SWAP_EN_V << PPA_BLEND0_RX_RGB_SWAP_EN_S)
#define PPA_BLEND0_RX_RGB_SWAP_EN_V  0x00000001U
#define PPA_BLEND0_RX_RGB_SWAP_EN_S  2
/** PPA_BLEND1_RX_RGB_SWAP_EN : R/W; bitpos: [3]; default: 0;
 *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
 *  would be swap to bgr.
 */
#define PPA_BLEND1_RX_RGB_SWAP_EN    (BIT(3))
#define PPA_BLEND1_RX_RGB_SWAP_EN_M  (PPA_BLEND1_RX_RGB_SWAP_EN_V << PPA_BLEND1_RX_RGB_SWAP_EN_S)
#define PPA_BLEND1_RX_RGB_SWAP_EN_V  0x00000001U
#define PPA_BLEND1_RX_RGB_SWAP_EN_S  3

/** PPA_BLEND_TRANS_MODE_REG register
 *  Blending engine mode configure register
 */
#define PPA_BLEND_TRANS_MODE_REG (DR_REG_PPA_BASE + 0x34)
/** PPA_BLEND_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable alpha blending.
 */
#define PPA_BLEND_EN    (BIT(0))
#define PPA_BLEND_EN_M  (PPA_BLEND_EN_V << PPA_BLEND_EN_S)
#define PPA_BLEND_EN_V  0x00000001U
#define PPA_BLEND_EN_S  0
/** PPA_BLEND_BYPASS : R/W; bitpos: [1]; default: 0;
 *  Set this bit to bypass blender. Then background date would be output.
 */
#define PPA_BLEND_BYPASS    (BIT(1))
#define PPA_BLEND_BYPASS_M  (PPA_BLEND_BYPASS_V << PPA_BLEND_BYPASS_S)
#define PPA_BLEND_BYPASS_V  0x00000001U
#define PPA_BLEND_BYPASS_S  1
/** PPA_BLEND_FIX_PIXEL_FILL_EN : R/W; bitpos: [2]; default: 0;
 *  This bit is used to enable fix pixel filling. When this mode is enable  only Tx
 *  channel is work and the output pixel is configured by PPA_OUT_FIX_PIXEL.
 */
#define PPA_BLEND_FIX_PIXEL_FILL_EN    (BIT(2))
#define PPA_BLEND_FIX_PIXEL_FILL_EN_M  (PPA_BLEND_FIX_PIXEL_FILL_EN_V << PPA_BLEND_FIX_PIXEL_FILL_EN_S)
#define PPA_BLEND_FIX_PIXEL_FILL_EN_V  0x00000001U
#define PPA_BLEND_FIX_PIXEL_FILL_EN_S  2
/** PPA_BLEND_TRANS_MODE_UPDATE : WT; bitpos: [3]; default: 0;
 *  Set this bit to update the transfer mode. Only the bit is set  the transfer mode is
 *  valid.
 */
#define PPA_BLEND_TRANS_MODE_UPDATE    (BIT(3))
#define PPA_BLEND_TRANS_MODE_UPDATE_M  (PPA_BLEND_TRANS_MODE_UPDATE_V << PPA_BLEND_TRANS_MODE_UPDATE_S)
#define PPA_BLEND_TRANS_MODE_UPDATE_V  0x00000001U
#define PPA_BLEND_TRANS_MODE_UPDATE_S  3
/** PPA_BLEND_RST : R/W; bitpos: [4]; default: 0;
 *  write 1 then write 0 to reset blending engine.
 */
#define PPA_BLEND_RST    (BIT(4))
#define PPA_BLEND_RST_M  (PPA_BLEND_RST_V << PPA_BLEND_RST_S)
#define PPA_BLEND_RST_V  0x00000001U
#define PPA_BLEND_RST_S  4
/** PPA_BLEND_TX_INF_SEL : R/W; bitpos: [6:5]; default: 0;
 *  unused ! Configures blend tx interface. 0: dma2d only, 1: le_enc only, 2: dma2d and
 *  ls_enc
 */
#define PPA_BLEND_TX_INF_SEL    0x00000003U
#define PPA_BLEND_TX_INF_SEL_M  (PPA_BLEND_TX_INF_SEL_V << PPA_BLEND_TX_INF_SEL_S)
#define PPA_BLEND_TX_INF_SEL_V  0x00000003U
#define PPA_BLEND_TX_INF_SEL_S  5

/** PPA_SR_FIX_ALPHA_REG register
 *  Scaling and rotating engine alpha override register
 */
#define PPA_SR_FIX_ALPHA_REG (DR_REG_PPA_BASE + 0x38)
/** PPA_SR_RX_FIX_ALPHA : R/W; bitpos: [7:0]; default: 128;
 *  The value would replace the alpha value in received pixel for Scaling and Rotating
 *  engine when PPA_SR_RX_ALPHA_CONF_EN is enabled.
 */
#define PPA_SR_RX_FIX_ALPHA    0x000000FFU
#define PPA_SR_RX_FIX_ALPHA_M  (PPA_SR_RX_FIX_ALPHA_V << PPA_SR_RX_FIX_ALPHA_S)
#define PPA_SR_RX_FIX_ALPHA_V  0x000000FFU
#define PPA_SR_RX_FIX_ALPHA_S  0
/** PPA_SR_RX_ALPHA_MOD : R/W; bitpos: [9:8]; default: 0;
 *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_SR_FIX_ALPHA. 2:
 *  Original alpha multiply with PPA_SR_FIX_ALPHA/256.
 */
#define PPA_SR_RX_ALPHA_MOD    0x00000003U
#define PPA_SR_RX_ALPHA_MOD_M  (PPA_SR_RX_ALPHA_MOD_V << PPA_SR_RX_ALPHA_MOD_S)
#define PPA_SR_RX_ALPHA_MOD_V  0x00000003U
#define PPA_SR_RX_ALPHA_MOD_S  8
/** PPA_SR_RX_ALPHA_INV : R/W; bitpos: [10]; default: 0;
 *  Set this bit to invert the original alpha value. When RX color mode is
 *  RGB565/RGB88. The original alpha value is 255.
 */
#define PPA_SR_RX_ALPHA_INV    (BIT(10))
#define PPA_SR_RX_ALPHA_INV_M  (PPA_SR_RX_ALPHA_INV_V << PPA_SR_RX_ALPHA_INV_S)
#define PPA_SR_RX_ALPHA_INV_V  0x00000001U
#define PPA_SR_RX_ALPHA_INV_S  10

/** PPA_BLEND_TX_SIZE_REG register
 *  Fix pixel filling mode image size register
 */
#define PPA_BLEND_TX_SIZE_REG (DR_REG_PPA_BASE + 0x3c)
/** PPA_BLEND_HB : R/W; bitpos: [13:0]; default: 0;
 *  The horizontal width of image block that would be filled in fix pixel filling mode
 *  or blend mode. The unit is pixel. Must be even num when YUV422 or YUV420
 */
#define PPA_BLEND_HB    0x00003FFFU
#define PPA_BLEND_HB_M  (PPA_BLEND_HB_V << PPA_BLEND_HB_S)
#define PPA_BLEND_HB_V  0x00003FFFU
#define PPA_BLEND_HB_S  0
/** PPA_BLEND_VB : R/W; bitpos: [27:14]; default: 0;
 *  The vertical width of image block that would be filled in fix pixel filling mode or
 *  blend mode. The unit is pixel. Must be even num when YUV420
 */
#define PPA_BLEND_VB    0x00003FFFU
#define PPA_BLEND_VB_M  (PPA_BLEND_VB_V << PPA_BLEND_VB_S)
#define PPA_BLEND_VB_V  0x00003FFFU
#define PPA_BLEND_VB_S  14

/** PPA_BLEND_FIX_ALPHA_REG register
 *  Blending engine alpha override register
 */
#define PPA_BLEND_FIX_ALPHA_REG (DR_REG_PPA_BASE + 0x40)
/** PPA_BLEND0_RX_FIX_ALPHA : R/W; bitpos: [7:0]; default: 128;
 *  The value would replace the alpha value in received pixel for background plane of
 *  blender when PPA_BLEND0_RX_ALPHA_CONF_EN is enabled.
 */
#define PPA_BLEND0_RX_FIX_ALPHA    0x000000FFU
#define PPA_BLEND0_RX_FIX_ALPHA_M  (PPA_BLEND0_RX_FIX_ALPHA_V << PPA_BLEND0_RX_FIX_ALPHA_S)
#define PPA_BLEND0_RX_FIX_ALPHA_V  0x000000FFU
#define PPA_BLEND0_RX_FIX_ALPHA_S  0
/** PPA_BLEND1_RX_FIX_ALPHA : R/W; bitpos: [15:8]; default: 128;
 *  The value would replace the alpha value in received pixel for foreground plane of
 *  blender when PPA_BLEND1_RX_ALPHA_CONF_EN is enabled.
 */
#define PPA_BLEND1_RX_FIX_ALPHA    0x000000FFU
#define PPA_BLEND1_RX_FIX_ALPHA_M  (PPA_BLEND1_RX_FIX_ALPHA_V << PPA_BLEND1_RX_FIX_ALPHA_S)
#define PPA_BLEND1_RX_FIX_ALPHA_V  0x000000FFU
#define PPA_BLEND1_RX_FIX_ALPHA_S  8
/** PPA_BLEND0_RX_ALPHA_MOD : R/W; bitpos: [17:16]; default: 0;
 *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_BLEND0_FIX_ALPHA. 2:
 *  Original alpha multiply with PPA_SR_BLEND0_ALPHA/256.
 */
#define PPA_BLEND0_RX_ALPHA_MOD    0x00000003U
#define PPA_BLEND0_RX_ALPHA_MOD_M  (PPA_BLEND0_RX_ALPHA_MOD_V << PPA_BLEND0_RX_ALPHA_MOD_S)
#define PPA_BLEND0_RX_ALPHA_MOD_V  0x00000003U
#define PPA_BLEND0_RX_ALPHA_MOD_S  16
/** PPA_BLEND1_RX_ALPHA_MOD : R/W; bitpos: [19:18]; default: 0;
 *  Alpha mode. 0/3: not replace alpha. 1: replace alpha with PPA_BLEND1_FIX_ALPHA. 2:
 *  Original alpha multiply with PPA_SR_BLEND1_ALPHA/256.
 */
#define PPA_BLEND1_RX_ALPHA_MOD    0x00000003U
#define PPA_BLEND1_RX_ALPHA_MOD_M  (PPA_BLEND1_RX_ALPHA_MOD_V << PPA_BLEND1_RX_ALPHA_MOD_S)
#define PPA_BLEND1_RX_ALPHA_MOD_V  0x00000003U
#define PPA_BLEND1_RX_ALPHA_MOD_S  18
/** PPA_BLEND0_RX_ALPHA_INV : R/W; bitpos: [20]; default: 0;
 *  Set this bit to invert the original alpha value. When RX color mode is
 *  RGB565/RGB88. The original alpha value is 255.
 */
#define PPA_BLEND0_RX_ALPHA_INV    (BIT(20))
#define PPA_BLEND0_RX_ALPHA_INV_M  (PPA_BLEND0_RX_ALPHA_INV_V << PPA_BLEND0_RX_ALPHA_INV_S)
#define PPA_BLEND0_RX_ALPHA_INV_V  0x00000001U
#define PPA_BLEND0_RX_ALPHA_INV_S  20
/** PPA_BLEND1_RX_ALPHA_INV : R/W; bitpos: [21]; default: 0;
 *  Set this bit to invert the original alpha value. When RX color mode is
 *  RGB565/RGB88. The original alpha value is 255.
 */
#define PPA_BLEND1_RX_ALPHA_INV    (BIT(21))
#define PPA_BLEND1_RX_ALPHA_INV_M  (PPA_BLEND1_RX_ALPHA_INV_V << PPA_BLEND1_RX_ALPHA_INV_S)
#define PPA_BLEND1_RX_ALPHA_INV_V  0x00000001U
#define PPA_BLEND1_RX_ALPHA_INV_S  21

