espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_reg.h
/** PPA_BLEND_RGB_REG register
 *  RGB color register
 */
#define PPA_BLEND_RGB_REG (DR_REG_PPA_BASE + 0x48)
/** PPA_BLEND1_RX_B : R/W; bitpos: [7:0]; default: 128;
 *  blue color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_B    0x000000FFU
#define PPA_BLEND1_RX_B_M  (PPA_BLEND1_RX_B_V << PPA_BLEND1_RX_B_S)
#define PPA_BLEND1_RX_B_V  0x000000FFU
#define PPA_BLEND1_RX_B_S  0
/** PPA_BLEND1_RX_G : R/W; bitpos: [15:8]; default: 128;
 *  green color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_G    0x000000FFU
#define PPA_BLEND1_RX_G_M  (PPA_BLEND1_RX_G_V << PPA_BLEND1_RX_G_S)
#define PPA_BLEND1_RX_G_V  0x000000FFU
#define PPA_BLEND1_RX_G_S  8
/** PPA_BLEND1_RX_R : R/W; bitpos: [23:16]; default: 128;
 *  red color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_R    0x000000FFU
#define PPA_BLEND1_RX_R_M  (PPA_BLEND1_RX_R_V << PPA_BLEND1_RX_R_S)
#define PPA_BLEND1_RX_R_V  0x000000FFU
#define PPA_BLEND1_RX_R_S  16

/** PPA_BLEND_FIX_PIXEL_REG register
 *  Blending engine fix pixel register
 */
#define PPA_BLEND_FIX_PIXEL_REG (DR_REG_PPA_BASE + 0x4c)
/** PPA_BLEND_TX_FIX_PIXEL : R/W; bitpos: [31:0]; default: 0;
 *  The configure fix pixel in fix pixel filling mode for blender engine.
 */
#define PPA_BLEND_TX_FIX_PIXEL    0xFFFFFFFFU
#define PPA_BLEND_TX_FIX_PIXEL_M  (PPA_BLEND_TX_FIX_PIXEL_V << PPA_BLEND_TX_FIX_PIXEL_S)
#define PPA_BLEND_TX_FIX_PIXEL_V  0xFFFFFFFFU
#define PPA_BLEND_TX_FIX_PIXEL_S  0

/** PPA_CK_FG_LOW_REG register
 *  foreground color key lower threshold
 */
#define PPA_CK_FG_LOW_REG (DR_REG_PPA_BASE + 0x50)
/** PPA_COLORKEY_FG_B_LOW : R/W; bitpos: [7:0]; default: 255;
 *  color key lower threshold of foreground b channel
 */
#define PPA_COLORKEY_FG_B_LOW    0x000000FFU
#define PPA_COLORKEY_FG_B_LOW_M  (PPA_COLORKEY_FG_B_LOW_V << PPA_COLORKEY_FG_B_LOW_S)
#define PPA_COLORKEY_FG_B_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_B_LOW_S  0
/** PPA_COLORKEY_FG_G_LOW : R/W; bitpos: [15:8]; default: 255;
 *  color key lower threshold of foreground g channel
 */
#define PPA_COLORKEY_FG_G_LOW    0x000000FFU
#define PPA_COLORKEY_FG_G_LOW_M  (PPA_COLORKEY_FG_G_LOW_V << PPA_COLORKEY_FG_G_LOW_S)
#define PPA_COLORKEY_FG_G_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_G_LOW_S  8
/** PPA_COLORKEY_FG_R_LOW : R/W; bitpos: [23:16]; default: 255;
 *  color key lower threshold of foreground r channel
 */
#define PPA_COLORKEY_FG_R_LOW    0x000000FFU
#define PPA_COLORKEY_FG_R_LOW_M  (PPA_COLORKEY_FG_R_LOW_V << PPA_COLORKEY_FG_R_LOW_S)
#define PPA_COLORKEY_FG_R_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_R_LOW_S  16

/** PPA_CK_FG_HIGH_REG register
 *  foreground color key higher threshold
 */
#define PPA_CK_FG_HIGH_REG (DR_REG_PPA_BASE + 0x54)
/** PPA_COLORKEY_FG_B_HIGH : R/W; bitpos: [7:0]; default: 0;
 *  color key higher threshold of foreground b channel
 */
#define PPA_COLORKEY_FG_B_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_B_HIGH_M  (PPA_COLORKEY_FG_B_HIGH_V << PPA_COLORKEY_FG_B_HIGH_S)
#define PPA_COLORKEY_FG_B_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_B_HIGH_S  0
/** PPA_COLORKEY_FG_G_HIGH : R/W; bitpos: [15:8]; default: 0;
 *  color key higher threshold of foreground g channel
 */
#define PPA_COLORKEY_FG_G_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_G_HIGH_M  (PPA_COLORKEY_FG_G_HIGH_V << PPA_COLORKEY_FG_G_HIGH_S)
#define PPA_COLORKEY_FG_G_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_G_HIGH_S  8
/** PPA_COLORKEY_FG_R_HIGH : R/W; bitpos: [23:16]; default: 0;
 *  color key higher threshold of foreground r channel
 */
#define PPA_COLORKEY_FG_R_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_R_HIGH_M  (PPA_COLORKEY_FG_R_HIGH_V << PPA_COLORKEY_FG_R_HIGH_S)
#define PPA_COLORKEY_FG_R_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_R_HIGH_S  16

/** PPA_CK_BG_LOW_REG register
 *  background color key lower threshold
 */
#define PPA_CK_BG_LOW_REG (DR_REG_PPA_BASE + 0x58)
/** PPA_COLORKEY_BG_B_LOW : R/W; bitpos: [7:0]; default: 255;
 *  color key lower threshold of background b channel
 */
#define PPA_COLORKEY_BG_B_LOW    0x000000FFU
#define PPA_COLORKEY_BG_B_LOW_M  (PPA_COLORKEY_BG_B_LOW_V << PPA_COLORKEY_BG_B_LOW_S)
#define PPA_COLORKEY_BG_B_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_B_LOW_S  0
/** PPA_COLORKEY_BG_G_LOW : R/W; bitpos: [15:8]; default: 255;
 *  color key lower threshold of background g channel
 */
#define PPA_COLORKEY_BG_G_LOW    0x000000FFU
#define PPA_COLORKEY_BG_G_LOW_M  (PPA_COLORKEY_BG_G_LOW_V << PPA_COLORKEY_BG_G_LOW_S)
#define PPA_COLORKEY_BG_G_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_G_LOW_S  8
/** PPA_COLORKEY_BG_R_LOW : R/W; bitpos: [23:16]; default: 255;
 *  color key lower threshold of background r channel
 */
#define PPA_COLORKEY_BG_R_LOW    0x000000FFU
#define PPA_COLORKEY_BG_R_LOW_M  (PPA_COLORKEY_BG_R_LOW_V << PPA_COLORKEY_BG_R_LOW_S)
#define PPA_COLORKEY_BG_R_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_R_LOW_S  16

/** PPA_CK_BG_HIGH_REG register
 *  background color key higher threshold
 */
#define PPA_CK_BG_HIGH_REG (DR_REG_PPA_BASE + 0x5c)
/** PPA_COLORKEY_BG_B_HIGH : R/W; bitpos: [7:0]; default: 0;
 *  color key higher threshold of background b channel
 */
#define PPA_COLORKEY_BG_B_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_B_HIGH_M  (PPA_COLORKEY_BG_B_HIGH_V << PPA_COLORKEY_BG_B_HIGH_S)
#define PPA_COLORKEY_BG_B_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_B_HIGH_S  0
/** PPA_COLORKEY_BG_G_HIGH : R/W; bitpos: [15:8]; default: 0;
 *  color key higher threshold of background g channel
 */
#define PPA_COLORKEY_BG_G_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_G_HIGH_M  (PPA_COLORKEY_BG_G_HIGH_V << PPA_COLORKEY_BG_G_HIGH_S)
#define PPA_COLORKEY_BG_G_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_G_HIGH_S  8
/** PPA_COLORKEY_BG_R_HIGH : R/W; bitpos: [23:16]; default: 0;
 *  color key higher threshold of background r channel
 */
#define PPA_COLORKEY_BG_R_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_R_HIGH_M  (PPA_COLORKEY_BG_R_HIGH_V << PPA_COLORKEY_BG_R_HIGH_S)
#define PPA_COLORKEY_BG_R_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_R_HIGH_S  16

/** PPA_CK_DEFAULT_REG register
 *  default value when foreground and background both in color key range
 */
#define PPA_CK_DEFAULT_REG (DR_REG_PPA_BASE + 0x60)
/** PPA_COLORKEY_DEFAULT_B : R/W; bitpos: [7:0]; default: 0;
 *  default B channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_B    0x000000FFU
#define PPA_COLORKEY_DEFAULT_B_M  (PPA_COLORKEY_DEFAULT_B_V << PPA_COLORKEY_DEFAULT_B_S)
#define PPA_COLORKEY_DEFAULT_B_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_B_S  0
/** PPA_COLORKEY_DEFAULT_G : R/W; bitpos: [15:8]; default: 0;
 *  default G channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_G    0x000000FFU
#define PPA_COLORKEY_DEFAULT_G_M  (PPA_COLORKEY_DEFAULT_G_V << PPA_COLORKEY_DEFAULT_G_S)
#define PPA_COLORKEY_DEFAULT_G_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_G_S  8
/** PPA_COLORKEY_DEFAULT_R : R/W; bitpos: [23:16]; default: 0;
 *  default R channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_R    0x000000FFU
#define PPA_COLORKEY_DEFAULT_R_M  (PPA_COLORKEY_DEFAULT_R_V << PPA_COLORKEY_DEFAULT_R_S)
#define PPA_COLORKEY_DEFAULT_R_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_R_S  16
/** PPA_COLORKEY_FG_BG_REVERSE : R/W; bitpos: [24]; default: 0;
 *  when pixel in bg ck range but not in fg ck range, 0: the result is bg, 1: the
 *  result is fg
 */
#define PPA_COLORKEY_FG_BG_REVERSE    (BIT(24))
#define PPA_COLORKEY_FG_BG_REVERSE_M  (PPA_COLORKEY_FG_BG_REVERSE_V << PPA_COLORKEY_FG_BG_REVERSE_S)
#define PPA_COLORKEY_FG_BG_REVERSE_V  0x00000001U
#define PPA_COLORKEY_FG_BG_REVERSE_S  24

