espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_reg.h
/** PPA_SR_SCAL_ROTATE_REG register
 *  Scaling and rotating coefficient register
 */
#define PPA_SR_SCAL_ROTATE_REG (DR_REG_PPA_BASE + 0x64)
/** PPA_SR_SCAL_X_INT : R/W; bitpos: [7:0]; default: 1;
 *  The integrated part of scaling coefficient in X direction.
 */
#define PPA_SR_SCAL_X_INT    0x000000FFU
#define PPA_SR_SCAL_X_INT_M  (PPA_SR_SCAL_X_INT_V << PPA_SR_SCAL_X_INT_S)
#define PPA_SR_SCAL_X_INT_V  0x000000FFU
#define PPA_SR_SCAL_X_INT_S  0
/** PPA_SR_SCAL_X_FRAG : R/W; bitpos: [11:8]; default: 0;
 *  The fragment part of scaling coefficient in X direction.
 */
#define PPA_SR_SCAL_X_FRAG    0x0000000FU
#define PPA_SR_SCAL_X_FRAG_M  (PPA_SR_SCAL_X_FRAG_V << PPA_SR_SCAL_X_FRAG_S)
#define PPA_SR_SCAL_X_FRAG_V  0x0000000FU
#define PPA_SR_SCAL_X_FRAG_S  8
/** PPA_SR_SCAL_Y_INT : R/W; bitpos: [19:12]; default: 1;
 *  The integrated part of scaling coefficient in Y direction.
 */
#define PPA_SR_SCAL_Y_INT    0x000000FFU
#define PPA_SR_SCAL_Y_INT_M  (PPA_SR_SCAL_Y_INT_V << PPA_SR_SCAL_Y_INT_S)
#define PPA_SR_SCAL_Y_INT_V  0x000000FFU
#define PPA_SR_SCAL_Y_INT_S  12
/** PPA_SR_SCAL_Y_FRAG : R/W; bitpos: [23:20]; default: 0;
 *  The fragment part of scaling coefficient in Y direction.
 */
#define PPA_SR_SCAL_Y_FRAG    0x0000000FU
#define PPA_SR_SCAL_Y_FRAG_M  (PPA_SR_SCAL_Y_FRAG_V << PPA_SR_SCAL_Y_FRAG_S)
#define PPA_SR_SCAL_Y_FRAG_V  0x0000000FU
#define PPA_SR_SCAL_Y_FRAG_S  20
/** PPA_SR_ROTATE_ANGLE : R/W; bitpos: [25:24]; default: 0;
 *  The rotate angle. 0: 0 degree. 1: 90 degree. 2: 180 degree. 3: 270 degree.
 */
#define PPA_SR_ROTATE_ANGLE    0x00000003U
#define PPA_SR_ROTATE_ANGLE_M  (PPA_SR_ROTATE_ANGLE_V << PPA_SR_ROTATE_ANGLE_S)
#define PPA_SR_ROTATE_ANGLE_V  0x00000003U
#define PPA_SR_ROTATE_ANGLE_S  24
/** PPA_SCAL_ROTATE_RST : R/W; bitpos: [26]; default: 0;
 *  Write 1 then write 0 to this bit to reset scaling and rotating engine.
 */
#define PPA_SCAL_ROTATE_RST    (BIT(26))
#define PPA_SCAL_ROTATE_RST_M  (PPA_SCAL_ROTATE_RST_V << PPA_SCAL_ROTATE_RST_S)
#define PPA_SCAL_ROTATE_RST_V  0x00000001U
#define PPA_SCAL_ROTATE_RST_S  26
/** PPA_SCAL_ROTATE_START : WT; bitpos: [27]; default: 0;
 *  Write 1 to enable scaling and rotating engine after parameter is configured.
 */
#define PPA_SCAL_ROTATE_START    (BIT(27))
#define PPA_SCAL_ROTATE_START_M  (PPA_SCAL_ROTATE_START_V << PPA_SCAL_ROTATE_START_S)
#define PPA_SCAL_ROTATE_START_V  0x00000001U
#define PPA_SCAL_ROTATE_START_S  27
/** PPA_SR_MIRROR_X : R/W; bitpos: [28]; default: 0;
 *  Image mirror in X direction. 0: disable, 1: enable
 */
#define PPA_SR_MIRROR_X    (BIT(28))
#define PPA_SR_MIRROR_X_M  (PPA_SR_MIRROR_X_V << PPA_SR_MIRROR_X_S)
#define PPA_SR_MIRROR_X_V  0x00000001U
#define PPA_SR_MIRROR_X_S  28
/** PPA_SR_MIRROR_Y : R/W; bitpos: [29]; default: 0;
 *  Image mirror in Y direction. 0: disable, 1: enable
 */
#define PPA_SR_MIRROR_Y    (BIT(29))
#define PPA_SR_MIRROR_Y_M  (PPA_SR_MIRROR_Y_V << PPA_SR_MIRROR_Y_S)
#define PPA_SR_MIRROR_Y_V  0x00000001U
#define PPA_SR_MIRROR_Y_S  29

/** PPA_SR_MEM_PD_REG register
 *  SR memory power done register
 */
#define PPA_SR_MEM_PD_REG (DR_REG_PPA_BASE + 0x68)
/** PPA_SR_MEM_CLK_ENA : R/W; bitpos: [0]; default: 0;
 *  Set this bit to force clock enable of scaling and rotating engine's data memory.
 */
#define PPA_SR_MEM_CLK_ENA    (BIT(0))
#define PPA_SR_MEM_CLK_ENA_M  (PPA_SR_MEM_CLK_ENA_V << PPA_SR_MEM_CLK_ENA_S)
#define PPA_SR_MEM_CLK_ENA_V  0x00000001U
#define PPA_SR_MEM_CLK_ENA_S  0
/** PPA_SR_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force power down scaling and rotating engine's data memory.
 */
#define PPA_SR_MEM_FORCE_PD    (BIT(1))
#define PPA_SR_MEM_FORCE_PD_M  (PPA_SR_MEM_FORCE_PD_V << PPA_SR_MEM_FORCE_PD_S)
#define PPA_SR_MEM_FORCE_PD_V  0x00000001U
#define PPA_SR_MEM_FORCE_PD_S  1
/** PPA_SR_MEM_FORCE_PU : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power up scaling and rotating engine's data memory.
 */
#define PPA_SR_MEM_FORCE_PU    (BIT(2))
#define PPA_SR_MEM_FORCE_PU_M  (PPA_SR_MEM_FORCE_PU_V << PPA_SR_MEM_FORCE_PU_S)
#define PPA_SR_MEM_FORCE_PU_V  0x00000001U
#define PPA_SR_MEM_FORCE_PU_S  2

/** PPA_REG_CONF_REG register
 *  Register clock enable register
 */
#define PPA_REG_CONF_REG (DR_REG_PPA_BASE + 0x6c)
/** PPA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  PPA register clock gate enable signal.
 */
#define PPA_CLK_EN    (BIT(0))
#define PPA_CLK_EN_M  (PPA_CLK_EN_V << PPA_CLK_EN_S)
#define PPA_CLK_EN_V  0x00000001U
#define PPA_CLK_EN_S  0

/** PPA_CLUT_CNT_REG register
 *  BLEND CLUT write counter register
 */
#define PPA_CLUT_CNT_REG (DR_REG_PPA_BASE + 0x70)
/** PPA_BLEND0_CLUT_CNT : RO; bitpos: [8:0]; default: 0;
 *  The write data counter of BLEND0 CLUT in fifo mode.
 */
#define PPA_BLEND0_CLUT_CNT    0x000001FFU
#define PPA_BLEND0_CLUT_CNT_M  (PPA_BLEND0_CLUT_CNT_V << PPA_BLEND0_CLUT_CNT_S)
#define PPA_BLEND0_CLUT_CNT_V  0x000001FFU
#define PPA_BLEND0_CLUT_CNT_S  0
/** PPA_BLEND1_CLUT_CNT : RO; bitpos: [17:9]; default: 0;
 *  The write data counter of BLEND1 CLUT in fifo mode.
 */
#define PPA_BLEND1_CLUT_CNT    0x000001FFU
#define PPA_BLEND1_CLUT_CNT_M  (PPA_BLEND1_CLUT_CNT_V << PPA_BLEND1_CLUT_CNT_S)
#define PPA_BLEND1_CLUT_CNT_V  0x000001FFU
#define PPA_BLEND1_CLUT_CNT_S  9

/** PPA_BLEND_ST_REG register
 *  Blending engine status register
 */
#define PPA_BLEND_ST_REG (DR_REG_PPA_BASE + 0x74)
/** PPA_BLEND_SIZE_DIFF_ST : RO; bitpos: [0]; default: 0;
 *  1: indicate the size of two image is different.
 */
#define PPA_BLEND_SIZE_DIFF_ST    (BIT(0))
#define PPA_BLEND_SIZE_DIFF_ST_M  (PPA_BLEND_SIZE_DIFF_ST_V << PPA_BLEND_SIZE_DIFF_ST_S)
#define PPA_BLEND_SIZE_DIFF_ST_V  0x00000001U
#define PPA_BLEND_SIZE_DIFF_ST_S  0
/** PPA_BLEND_YUV_X_SCALE_ERR_ST : RO; bitpos: [1]; default: 0;
 *  Represents that x param is an odd num when enable yuv422 or yuv420
 */
#define PPA_BLEND_YUV_X_SCALE_ERR_ST    (BIT(1))
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_M  (PPA_BLEND_YUV_X_SCALE_ERR_ST_V << PPA_BLEND_YUV_X_SCALE_ERR_ST_S)
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_V  0x00000001U
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_S  1
/** PPA_BLEND_YUV_Y_SCALE_ERR_ST : RO; bitpos: [2]; default: 0;
 *  Represents that y param is an odd num when enable yuv420
 */
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST    (BIT(2))
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_M  (PPA_BLEND_YUV_Y_SCALE_ERR_ST_V << PPA_BLEND_YUV_Y_SCALE_ERR_ST_S)
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_V  0x00000001U
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_S  2

/** PPA_SR_PARAM_ERR_ST_REG register
 *  Scaling and rotating coefficient error register
 */
#define PPA_SR_PARAM_ERR_ST_REG (DR_REG_PPA_BASE + 0x78)
/** PPA_TX_DSCR_VB_ERR_ST : RO; bitpos: [0]; default: 0;
 *  The error is that the scaled VB plus the offset of Y coordinate in 2DDMA receive
 *  descriptor is larger than VA in 2DDMA receive descriptor.
 */
#define PPA_TX_DSCR_VB_ERR_ST    (BIT(0))
#define PPA_TX_DSCR_VB_ERR_ST_M  (PPA_TX_DSCR_VB_ERR_ST_V << PPA_TX_DSCR_VB_ERR_ST_S)
#define PPA_TX_DSCR_VB_ERR_ST_V  0x00000001U
#define PPA_TX_DSCR_VB_ERR_ST_S  0
/** PPA_TX_DSCR_HB_ERR_ST : RO; bitpos: [1]; default: 0;
 *  The error is that the scaled HB plus the offset of X coordinate in 2DDMA receive
 *  descriptor is larger than HA in 2DDMA receive descriptor.
 */
#define PPA_TX_DSCR_HB_ERR_ST    (BIT(1))
#define PPA_TX_DSCR_HB_ERR_ST_M  (PPA_TX_DSCR_HB_ERR_ST_V << PPA_TX_DSCR_HB_ERR_ST_S)
#define PPA_TX_DSCR_HB_ERR_ST_V  0x00000001U
#define PPA_TX_DSCR_HB_ERR_ST_S  1
/** PPA_Y_RX_SCAL_EQUAL_0_ERR_ST : RO; bitpos: [2]; default: 0;
 *  The error is that the PPA_SR_SCAL_Y_INT and PPA_SR_CAL_Y_FRAG both are 0.
 */
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST    (BIT(2))
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_M  (PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_V << PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_S)
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_V  0x00000001U
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_S  2
/** PPA_RX_DSCR_VB_ERR_ST : RO; bitpos: [3]; default: 0;
 *  The error is that VB in 2DDMA receive descriptor plus the offset of Y coordinate in
 *  2DDMA transmit descriptor is larger than VA in 2DDMA transmit descriptor
 */
#define PPA_RX_DSCR_VB_ERR_ST    (BIT(3))
#define PPA_RX_DSCR_VB_ERR_ST_M  (PPA_RX_DSCR_VB_ERR_ST_V << PPA_RX_DSCR_VB_ERR_ST_S)
#define PPA_RX_DSCR_VB_ERR_ST_V  0x00000001U
#define PPA_RX_DSCR_VB_ERR_ST_S  3
/** PPA_YDST_LEN_TOO_SAMLL_ERR_ST : RO; bitpos: [4]; default: 0;
 *  The error is that the scaled image width is 0. For example.  when source width is
 *  14. scaled value is 1/16. and no rotate operation. then scaled width would be 0 as
 *  the result would be floored.
 */
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST    (BIT(4))
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_M  (PPA_YDST_LEN_TOO_SAMLL_ERR_ST_V << PPA_YDST_LEN_TOO_SAMLL_ERR_ST_S)
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_V  0x00000001U
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_S  4
/** PPA_YDST_LEN_TOO_LARGE_ERR_ST : RO; bitpos: [5]; default: 0;
 *  The error is that the scaled width is larger than (2^13 - 1).
 */
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST    (BIT(5))
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_M  (PPA_YDST_LEN_TOO_LARGE_ERR_ST_V << PPA_YDST_LEN_TOO_LARGE_ERR_ST_S)
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_V  0x00000001U
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_S  5
/** PPA_X_RX_SCAL_EQUAL_0_ERR_ST : RO; bitpos: [6]; default: 0;
 *  The error is that the scaled image height is 0.
 */
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST    (BIT(6))
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_M  (PPA_X_RX_SCAL_EQUAL_0_ERR_ST_V << PPA_X_RX_SCAL_EQUAL_0_ERR_ST_S)
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_V  0x00000001U
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_S  6
/** PPA_RX_DSCR_HB_ERR_ST : RO; bitpos: [7]; default: 0;
 *  The error is that the HB in 2DDMA transmit descriptor plus the offset of X
 *  coordinate in 2DDMA transmit descriptor is larger than HA in 2DDMA transmit
 *  descriptor.
 */
#define PPA_RX_DSCR_HB_ERR_ST    (BIT(7))
#define PPA_RX_DSCR_HB_ERR_ST_M  (PPA_RX_DSCR_HB_ERR_ST_V << PPA_RX_DSCR_HB_ERR_ST_S)
#define PPA_RX_DSCR_HB_ERR_ST_V  0x00000001U
#define PPA_RX_DSCR_HB_ERR_ST_S  7
/** PPA_XDST_LEN_TOO_SAMLL_ERR_ST : RO; bitpos: [8]; default: 0;
 *  The error is that the scaled image height is 0. For example.  when source height is
 *  14. scaled value is 1/16. and no rotate operation. then scaled height would be 0 as
 *  the result would be floored.
 */
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST    (BIT(8))
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_M  (PPA_XDST_LEN_TOO_SAMLL_ERR_ST_V << PPA_XDST_LEN_TOO_SAMLL_ERR_ST_S)
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_V  0x00000001U
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_S  8
/** PPA_XDST_LEN_TOO_LARGE_ERR_ST : RO; bitpos: [9]; default: 0;
 *  The error is that the scaled image height is larger than (2^13 - 1).
 */
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST    (BIT(9))
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_M  (PPA_XDST_LEN_TOO_LARGE_ERR_ST_V << PPA_XDST_LEN_TOO_LARGE_ERR_ST_S)
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_V  0x00000001U
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_S  9
/** PPA_X_YUV420_RX_SCALE_ERR_ST : RO; bitpos: [10]; default: 0;
 *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
 *  yuv422 or yuv420 rx
 */
#define PPA_X_YUV420_RX_SCALE_ERR_ST    (BIT(10))
#define PPA_X_YUV420_RX_SCALE_ERR_ST_M  (PPA_X_YUV420_RX_SCALE_ERR_ST_V << PPA_X_YUV420_RX_SCALE_ERR_ST_S)
#define PPA_X_YUV420_RX_SCALE_ERR_ST_V  0x00000001U
#define PPA_X_YUV420_RX_SCALE_ERR_ST_S  10
/** PPA_Y_YUV420_RX_SCALE_ERR_ST : RO; bitpos: [11]; default: 0;
 *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
 *  yuv420 rx
 */
#define PPA_Y_YUV420_RX_SCALE_ERR_ST    (BIT(11))
#define PPA_Y_YUV420_RX_SCALE_ERR_ST_M  (PPA_Y_YUV420_RX_SCALE_ERR_ST_V << PPA_Y_YUV420_RX_SCALE_ERR_ST_S)
#define PPA_Y_YUV420_RX_SCALE_ERR_ST_V  0x00000001U
#define PPA_Y_YUV420_RX_SCALE_ERR_ST_S  11
/** PPA_X_YUV420_TX_SCALE_ERR_ST : RO; bitpos: [12]; default: 0;
 *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
 *  yuv422 or yuv420 tx
 */
#define PPA_X_YUV420_TX_SCALE_ERR_ST    (BIT(12))
#define PPA_X_YUV420_TX_SCALE_ERR_ST_M  (PPA_X_YUV420_TX_SCALE_ERR_ST_V << PPA_X_YUV420_TX_SCALE_ERR_ST_S)
#define PPA_X_YUV420_TX_SCALE_ERR_ST_V  0x00000001U
#define PPA_X_YUV420_TX_SCALE_ERR_ST_S  12
/** PPA_Y_YUV420_TX_SCALE_ERR_ST : RO; bitpos: [13]; default: 0;
 *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
 *  yuv420 tx
 */
#define PPA_Y_YUV420_TX_SCALE_ERR_ST    (BIT(13))
#define PPA_Y_YUV420_TX_SCALE_ERR_ST_M  (PPA_Y_YUV420_TX_SCALE_ERR_ST_V << PPA_Y_YUV420_TX_SCALE_ERR_ST_S)
#define PPA_Y_YUV420_TX_SCALE_ERR_ST_V  0x00000001U
#define PPA_Y_YUV420_TX_SCALE_ERR_ST_S  13

